app/controllers/admin/artists_controller.rb

SELECT * FROM `artists`
---
  def index
    @artists = Artist.all

SELECT * FROM `artists` WHERE (`artists`.`id` = 3)
---
  def show
    @artist = Artist.find(params[:id])

SELECT * FROM `artists` WHERE (`artists`.`id` = 3)
---
  def edit
    @artist = Artist.find(params[:id])

INSERT INTO `artists` (`name`, `created_at`, `photo_file_size`, `updated_at`, `photo_file_name`, `photo_content_type`, `photo_updated_at`, `bio`) VALUES('', '2010-06-07 07:15:51', NULL, '2010-06-07 07:15:51', NULL, NULL, NULL, '')
---
  def create
    @artist = Artist.new(params[:artist])

    respond_to do |format|
      if @artist.save

SELECT * FROM `artists` WHERE (`artists`.`id` = 3)
UPDATE `artists` SET `updated_at` = '2010-06-06 22:26:55', `photo_file_name` = 'EY5.Trdmrk.rgb_Icon2.TM.png', `photo_updated_at` = '2010-06-06 22:26:54', `photo_file_size` = 26779, `photo_content_type` = 'image/png' WHERE `id` = 1
---
  def update
    @artist = Artist.find(params[:id])

    respond_to do |format|
      if @artist.update_attributes(params[:artist])

SELECT * FROM `artists` WHERE (`artists`.`id` = 3)
DELETE FROM `artists` WHERE `id` = 3
---
  def destroy
    @artist = Artist.find(params[:id])
    @artist.destroy