app/controllers/admin/events_controller.rb

SELECT * FROM `events`
---
  def index
    @events = Event.all

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO `events` (`name`, `created_at`, `updated_at`, `date`, `description`) VALUES('Test', '2010-06-07 04:22:59', '2010-06-07 04:22:59', '2010-06-07', 'This was awesome!')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def update
    @event = Event.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 2)
DELETE FROM `events` WHERE `id` = 2
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy