app/controllers/admin/mixes_controller.rb

  def index
    @mixes = Mix.all
---
SELECT * FROM `mixes`

  def edit
    @mix = Mix.find(params[:id])
---
SELECT * FROM `mixes` WHERE (`mixes`.`id` = 1)

  def create
    @mix = Mix.new(params[:mix])

    respond_to do |format|
      if @mix.save
---
INSERT INTO `mixes` (`created_at`, `title`, `updated_at`, `url`) VALUES('2010-05-30 07:14:12', 'Jaguar', '2010-05-30 07:14:12', 'http://redlightmusic.com/wp-content/uploads/shalako_jaguar.mp3')

  def update
    @mix = Mix.find(params[:id])

    respond_to do |format|
      if @mix.update_attributes(params[:mix])
---
SELECT * FROM `mixes` WHERE (`mixes`.`id` = 6)
UPDATE `mixes` SET `updated_at` = '2010-05-31 20:43:30', `artist_id` = 2 WHERE `id` = 6

  def destroy
    @mix = Mix.find(params[:id])
    @mix.destroy
---
SELECT * FROM `mixes` WHERE (`mixes`.`id` = 4)
DELETE FROM `mixes` WHERE `id` = 4