app/controllers/admin/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('addy', '21586558600.0643357163600914', '2010-05-29 03:22:04', '2010-05-29 03:22:04', 'f54bbe3b36d2c93874ff9ad14847c6c5093da25f')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 13) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-06-07 15:54:25', `salt` = '21810240600.704983109320571', `hashed_password` = '57831d71b784d69e4ed9956b8231aa4b31432a9a' WHERE `id` = 13
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 4
---
  def destroy
    @user = User.find(params[:id])
		begin
			flash[:notice] = "User #{@user.name} deleted"
			@user.destroy