app/controllers/artists_controller.rb

SELECT * FROM `artists`
---
  def index
    @artists = Artist.all

SELECT * FROM `artists` WHERE (`artists`.`id` = 1)
---
  def show
    @artist = Artist.find(params[:id])