app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT * FROM `events`

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)