app/controllers/mixes_controller.rb

  def index
    @mixes = Mix.all
---
SELECT * FROM `mixes`

  def show
    @mix = Mix.find(params[:id], :include=>:artist)
---
SELECT * FROM `artists` WHERE (`artists`.`id` = 1)
SELECT * FROM `mixes` WHERE (`mixes`.`id` = 1)